---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.TextureAngle
source: html/1007a66e-fc52-2567-f089-349728973048.htm
---
# Autodesk.Revit.DB.Visual.Noise.TextureAngle Property

The property labeled "Angle" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string TextureAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray3d".